app/controllers/casein/casos_controller.rb

    def index
      @casein_page_title = 'Casos'
  		@casos = Caso.order(sort_order(:casename)).paginate :page => params[:page]
---
SELECT  "casos".* FROM "casos"   ORDER BY casename   LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "casos"

    def show
      @casein_page_title = 'View caso'
      @caso = Caso.find params[:id]
---
SELECT  "casos".* FROM "casos"  WHERE "casos"."id" = ? LIMIT 1  [["id", 1]]