app/controllers/caso_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
	def new
        #@caso = Caso.new
        @user = User.find_by_id(current_user.id)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
    def index
        #@casos = Caso.all
        @user = User.find_by_id(current_user.id)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "casos" ("casename", "created_at", "desc", "place_occu", "status", "updated_at", "user_id", "victname") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        #@user = User.find_by_id(current_user.id)
        #@casos = @user.casos
        @user = User.find_by_id(current_user.id)
        @caso = @user.casos.build(caso_params)

        respond_to do |format|
          if @caso.save