app/controllers/caso_controller.rb

    def index
        @casos = Caso.all
---
SELECT "casos".* FROM "casos"