app/controllers/profiles_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
  def index
    #@profiles = Profile.all
    @user = User.find_by_id(current_user.id)

SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."user_id" = 1 LIMIT 1
---
 def edit
    @profile = Profile.find_by_user_id(current_user.id)

INSERT INTO "profiles" ("created_at", "facebook_profile", "instagram_profile", "lastname", "name", "nickname", "twitter_profile", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @profile = Profile.new(profile_params)
    @profile.user_id = current_user.id
    if @profile.save

SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "profiles" SET "facebook_profile" = ?, "instagram_profile" = ?, "lastname" = ?, "name" = ?, "nickname" = ?, "twitter_profile" = ?, "updated_at" = ? WHERE "profiles"."id" = 1
---
 def update
    @profile = Profile.find(params[:id])
    if @profile.update(profile_params)

SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 2]]
---
  def destroy
    @profile = Profile.find(params[:id])
    @profile.destroy

SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."user_id" = 1 LIMIT 1
---
    def set_profile
      @profile = Profile.find_by_user_id(current_user.id)